In [110]:
import pandas as pd

In [111]:
import pandas as pd
dict_1 = { 'Name':['Pranava', 'Chinnu', 'Pranu', 'vidhathri', 'Pandu','Sugandha', 'Sweety'], 
           'Marks':[60,50,40,90,85, 95, 100], 
          'Gender':['Male', 'Male', 'Female','Female', 'Male', 'Female', 'Female']
          }
df1=pd.DataFrame(dict_1)

In [112]:
df1

        Name  Marks  Gender
0    Pranava     60    Male
1     Chinnu     50    Male
2      Pranu     40  Female
3  vidhathri     90  Female
4      Pandu     85    Male
5   Sugandha     95  Female
6     Sweety    100  Female

In [113]:
#1. Display Top 3 Rows of the Dataset
df1.head(3)

      Name  Marks  Gender
0  Pranava     60    Male
1   Chinnu     50    Male
2    Pranu     40  Female

In [114]:
#2. Check the last 3 rows of the data set
df1.tail(3)

       Name  Marks  Gender
4     Pandu     85    Male
5  Sugandha     95  Female
6    Sweety    100  Female

In [115]:
#3. Find shape of our Dataset(Number of Rows & Number of columns) 
#shape is not method, it is an attribute of pandas dataframe
df1.shape

(7, 3)

In [116]:
print('Number of rows', df1.shape[0])
print('Number of columns', df1.shape[1])

Number of rows 7
Number of columns 3

In [117]:
#4. Get Info about our dataset like total no. of rows, total no. of columns, Datatypes of each column and memory Requirement
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [118]:
#5. Check Null Values in the Dataset
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [119]:
#df1.null().sum(axis=0) displays the count of null values in column wise and df1.isnull().sum(axis=1) displays row wise
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [120]:
#6. Get overall statistics about the dataframe
df1.describe() # it shows only numerical column here from the dataset

            Marks
count    7.000000
mean    74.285714
std     23.879659
min     40.000000
25%     55.000000
50%     85.000000
75%     92.500000
max    100.000000

In [121]:
#This shows statistics for all the columns
df1.describe(include='all')

           Name       Marks  Gender
count         7    7.000000       7
unique        7         NaN       2
top     Pranava         NaN  Female
freq          1         NaN       4
mean        NaN   74.285714     NaN
std         NaN   23.879659     NaN
min         NaN   40.000000     NaN
25%         NaN   55.000000     NaN
50%         NaN   85.000000     NaN
75%         NaN   92.500000     NaN
max         NaN  100.000000     NaN

In [122]:
#7. Find unique values form the gender column. # always using [] for columns
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [123]:
#8. Find the no. of unique from the gender column. 
df1['Gender'].nunique()

2

In [124]:
#9. Display count of unique values in Gender column
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [125]:
#10. Find Total Number of students Having Marks Between 90 to 100(inclusive) using Between Method.
sum(df1['Marks'].between(90,100))

3

In [126]:
# without using between method for above question(10)

(df1['Marks']>=90) & (df1['Marks']<=100) # step - 1 to boolean series is generated

df1[(df1['Marks']>=90) & (df1['Marks']<=100)]  # step - 2 to check the all column and rows of marks btwn 90 and 100

len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)]) # step - 2 here, len() is used to find the total no of students who has marks btwn 90 to 100

3

In [127]:
#11. Find average Marks                       
df1['Marks'].mean()    # mean() is used to find the avg of the marks column       

#Similarly we have inbuild methods like median(), min(), max() etc.

74.28571428571429

In [190]:
#12. Apply method - we define a method to use further 
def marks(x):
    return x/2 # we can use any operations
                               # calling the defined function using apply method by creating a new column as half_marks
df1['Marks'].apply(marks)

0    30.0
1    25.0
2    20.0
3    45.0
4    42.5
5    47.5
6    50.0
Name: Marks, dtype: float64

In [191]:
df1['half_marks'] = df1['Marks'].apply(marks) # creating a new column as hald_marks to the existing data frame
print(df1)

        Name  Marks  Gender  Male_female  half_marks
0    Pranava     60    Male            0        30.0
1     Chinnu     50    Male            0        25.0
2      Pranu     40  Female            1        20.0
3  vidhathri     90  Female            1        45.0
4      Pandu     85    Male            0        42.5
5   Sugandha     95  Female            1        47.5
6     Sweety    100  Female            1        50.0

        Name  Marks  Gender  half_marks
0    Pranava     60    Male        30.0
1     Chinnu     50    Male        25.0
2      Pranu     40  Female        20.0
3  vidhathri     90  Female        45.0
4      Pandu     85    Male        42.5
5   Sugandha     95  Female        47.5
6     Sweety    100  Female        50.0

In [131]:
#df1['new'] = 'null' - to create a new column with null as row values
#df1 = df1.drop('new', axis = 1) - to delete a column, axis=1 is mandatory as it refers rows to be deleted

In [183]:
# Using Lambda Function
df1['Marks'].apply(lambda x: x+2)
# we can perform in single line using lambda function instead of apply method

0     62
1     52
2     42
3     92
4     87
5     97
6    102
Name: Marks, dtype: int64

In [149]:
# To find the length of the strings in a particular column for each row using apply and len method
df1['Name'].apply(len)

0    7
1    6
2    5
3    9
4    5
5    8
6    6
Name: Name, dtype: int64

In [192]:
#13. Map function
df1['Male_female'] = df1["Gender"].map({'Male':0,'Female':1})  # it converts 0 and 1 for gender column with a new column.
df1

        Name  Marks  Gender  Male_female  half_marks
0    Pranava     60    Male            0        30.0
1     Chinnu     50    Male            0        25.0
2      Pranu     40  Female            1        20.0
3  vidhathri     90  Female            1        45.0
4      Pandu     85    Male            0        42.5
5   Sugandha     95  Female            1        47.5
6     Sweety    100  Female            1        50.0

In [194]:
#14. Drop the columns
#df1.drop('Male_female', axis=1) # to drop single column
df1.drop(['half_marks','Male_female'], axis=1, inplace=True)            #inplace=TRUE is used to return a new dataframe with the column dropped and df1 would remain same

In [195]:
df1

        Name  Marks  Gender
0    Pranava     60    Male
1     Chinnu     50    Male
2      Pranu     40  Female
3  vidhathri     90  Female
4      Pandu     85    Male
5   Sugandha     95  Female
6     Sweety    100  Female

In [196]:
#15. Print Name of the Columns
df1.columns       #It is used to retrive the name of the columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [204]:
#16. Sort the Dataframe as per the marks column
#df1.sort_values(by='Marks', ascending=False) #To drop single column        #by default it will be in ascending order to make it descending, Use ascending=False)

df1.sort_values(by=['Marks', 'Gender'], ascending=False)

        Name  Marks  Gender
6     Sweety    100  Female
5   Sugandha     95  Female
3  vidhathri     90  Female
4      Pandu     85    Male
0    Pranava     60    Male
1     Chinnu     50    Male
2      Pranu     40  Female

In [197]:
#index is used to know the range of index for each row.
df1.index

RangeIndex(start=0, stop=7, step=1)

In [209]:
#17. Display Name & Marks of the Female Students.
df1[df1['Gender']== 'Female'] [['Name','Marks']] # using 2D list name and marks to compare

        Name  Marks
2      Pranu     40
3  vidhathri     90
5   Sugandha     95
6     Sweety    100

In [215]:
#Alternate way
df1[df1['Gender'].isin(['Female'])] [['Name','Marks']]

        Name  Marks
2      Pranu     40
3  vidhathri     90
5   Sugandha     95
6     Sweety    100